1) merge(df1,df2 , on = 'base of merging it ' ,how = 'inner' * it can be something else also like cross,outer etc  ) 
2) concat(df1,df2, axis = 0  axis = 1 for column and axis = 0  for column  )

In [1]:
import pandas as pd
import numpy as np

In [4]:
data1 ={
    'id':['1','2','3'],
    'name' : ['Ali','Ahmed','zain'],
    'age' :['22','21','18']
}

df1 = pd.DataFrame(data1)
df1.head()

  id   name age
0  1    Ali  22
1  2  Ahmed  21
2  3   zain  18

In [9]:
data2 ={
    'id':['1','2','3'],
    'location' : ['karachi','lahore','peshawar'],
    'dummy' :['abc','xyz','zzz']
}

df2 = pd.DataFrame(data2)
df2.head()

  id  location dummy
0  1   karachi   abc
1  2    lahore   xyz
2  3  peshawar   zzz

In [10]:
dfall = pd.merge(df1,df2 , on = 'id' , how ='inner' )
dfall.head()

  id   name age  location dummy
0  1    Ali  22   karachi   abc
1  2  Ahmed  21    lahore   xyz
2  3   zain  18  peshawar   zzz

There are many more merging techniques